<a href="https://colab.research.google.com/github/divitya22/assignmentgramoday/blob/main/Pandas_Tutorial_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:

from google.colab import drive
drive.mount("/content/gdrive")

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

** Importing Pandas Library**

In [ ]:
import pandas as pd

** Reading CSV file**

In [ ]:
df=pd.read_csv("/content/gdrive/MyDrive/for_GitHub/Pandas_tutorial/train.csv")

In [ ]:
df.head()
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

**Shape of Dataframe**

In [ ]:
df.shape

(891, 12)

**Size of Dataframe**

In [ ]:
df.size

10692

**Name of all columns of Dataframe**

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

**Info function give us brief summary of dataframe**

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**Datatype of particular column**

In [ ]:
df.dtypes
df[["Survived"]].dtypes

Survived    int64
dtype: object

In [ ]:
df[["PassengerId"]].dtypes

PassengerId    int64
dtype: object

**To check null values in dataframe**

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**To check unique values in dataframe**

In [ ]:
df.nunique()
df["Survived"].nunique()

2

**Describe method used for calculating statistical data**

In [ ]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
df.describe(include=[object])

                    Name   Sex  Ticket        Cabin Embarked
count                891   891     891          204      889
unique               891     2     681          147        3
top     Razi, Mr. Raihed  male  347082  C23 C25 C27        S
freq                   1   577       7            4      644

**how to select one column from dataframe**

In [ ]:


df[["Survived"]].head()

   Survived
0         0
1         1
2         1
3         1
4         0

**Value_counts() gives you unique value in each column**

In [ ]:
df[["Survived"]].value_counts()

Survived
0           549
1           342
dtype: int64

**We can also create dataframe from selected columns**

In [ ]:
new_df=df[["PassengerId","Survived"]]

In [ ]:
new_df.head()

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

**iloc and loc-----used to access data from dataframe**

**loc---we can use both int value and column name,,,
iloc----we can use only int values**

In [ ]:
new_df.loc[0]["Survived"]
new_df.loc[4]["PassengerId"]

5

above we are gettiing value from 4th row and "passenger_ID"column

In [ ]:
new_df.iloc[3][1]

1

**Using iloc we get value from 3rd row and 1st column**

In [ ]:
new_df.iloc[3][1]=40

 **We have changes value above from 1 to 40**

In [ ]:
new_df.head()

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4        40
4            5         0

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:

df.shape

(891, 12)

**We have 891 rows and 12 columns**

In [ ]:
df.dropna(inplace=True,how="any")

In [ ]:
df.shape

(183, 12)

**After applying dropna() method which will remove null values our rows are reduced**

In [ ]:
df.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
3             4         1       1  ...  53.1000  C123         S
6             7         0       1  ...  51.8625   E46         S
10           11         1       3  ...  16.7000    G6         S
11           12         1       1  ...  26.5500  C103         S

[5 rows x 12 columns]

**Reset_index**

In [ ]:
df.reset_index(drop=True,inplace=True) # what will happen if you donot put drop=True

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            2         1       1  ...  71.2833   C85         C
1            4         1       1  ...  53.1000  C123         S
2            7         0       1  ...  51.8625   E46         S
3           11         1       3  ...  16.7000    G6         S
4           12         1       1  ...  26.5500  C103         S

[5 rows x 12 columns]

In [ ]:
df["Fare"].max()

512.3292

In [ ]:
df["Fare"].min()

0.0

**Renaming column**

In [ ]:
df.rename(columns={"Sex":"Gender"},inplace=True)

In [ ]:
df.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            2         1       1  ...  71.2833   C85         C
1            4         1       1  ...  53.1000  C123         S

[2 rows x 12 columns]

**Delete rows**

In [ ]:
df.drop("Cabin",inplace=True,axis=1)

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...    Ticket     Fare  Embarked
0            2         1       1  ...  PC 17599  71.2833         C
1            4         1       1  ...    113803  53.1000         S
2            7         0       1  ...     17463  51.8625         S
3           11         1       3  ...   PP 9549  16.7000         S
4           12         1       1  ...    113783  26.5500         S

[5 rows x 11 columns]

In [ ]:
# n Largest value

**n largest value from particular column**

In [ ]:
df["Fare"].nlargest(2)

137    512.3292
153    512.3292
Name: Fare, dtype: float64

In [ ]:
df.iloc[137][9]

**To check duplicate values**

In [ ]:
df[df["PassengerId"].duplicated(keep=False)]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Gender, Age, SibSp, Parch, Ticket, Fare, Embarked]
Index: []

In [ ]:
df.iloc[0][3]

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

** Replace : Suppose you want to change name of specific passenger**

In [ ]:
df["Name"].replace({"Cumings, Mrs. John Bradley (Florence Briggs Thayer)":"Mr_Braund"},inplace=True)

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...    Ticket     Fare  Embarked
0            2         1       1  ...  PC 17599  71.2833         C
1            4         1       1  ...    113803  53.1000         S
2            7         0       1  ...     17463  51.8625         S
3           11         1       3  ...   PP 9549  16.7000         S
4           12         1       1  ...    113783  26.5500         S

[5 rows x 11 columns]

**Data type conversion(Convert column "age" from float to int)**

In [ ]:
df.iloc[0][3]

'Mr_Braund'

In [ ]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Gender          object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [ ]:
df["Age"]=df["Age"].astype("int")

In [ ]:
df.head(2)

   PassengerId  Survived  Pclass  ...    Ticket     Fare  Embarked
0            2         1       1  ...  PC 17599  71.2833         C
1            4         1       1  ...    113803  53.1000         S

[2 rows x 11 columns]

In [ ]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Gender          object
Age              int64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

**to set particular column as index**

In [ ]:
df.set_index(keys=["PassengerId"],inplace=True)

In [ ]:
df.head()

             Survived  Pclass  ...     Fare Embarked
PassengerId                    ...
2                   1       1  ...  71.2833        C
4                   1       1  ...  53.1000        S
7                   0       1  ...  51.8625        S
11                  1       3  ...  16.7000        S
12                  1       1  ...  26.5500        S

[5 rows x 10 columns]

**Pivot table**

In [ ]:
import numpy as np

In [ ]:
survd=df.pivot_table(values="Fare",index="Survived",columns="Gender",aggfunc=np.sum)

In [ ]:
survd

Gender       female       male
Survived
0          363.2375  3479.6582
1         7468.8417  3087.1544